{
  "name": "The Firey Depths ",
  "description": "So you\u0027ve built your first Nether Portal, but what it is exactly that is in there? What kind of new hell awaits you in the firey depths. Ghast, Zombie Pigmen and so much more. It\u0027s time to learn about the world beyond ",
  "quests": [
    {
      "name": "Crystal Clear",
      "description": "You\u0027ve entered the firey hellscape that is the nether, it\u0027s a wonderful place isn\u0027t it? Alright well that\u0027s a lie, but it does have a certain charm we suppose. It\u0027s time to learn what you can about this place and the resources you\u0027ll need from it. ",
      "x": 21,
      "y": 15,
      "icon": {
        "id": "minecraft:quartz_ore"
      },
      "prerequisites": [
        "{Chapter 1 - The Basics}[Hard as Glass]"
      ],
      "trigger": "ANTI_TRIGGER",
      "tasks": [
        {
          "type": "DETECT",
          "description": "Hells Diamonds",
          "longDescription": "Quartz has some interesting properties which allow it to give off a certain electrical charge. So it\u0027s a good resource to farm. Having the Fortune enchant on a pick when mining it might net you more ",
          "items": [
            {
              "item": {
                "id": "minecraft:quartz"
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "You are my sunshine",
          "longDescription": "Because so many things depend on the sun in the overworld, why not make use of a device that lets you know when it\u0027s actually out? Meet the Daylight sensor, which will send out a redstone pulse depending on the position of the sun. It is crafted with glass, quartz, and wood planks ",
          "items": [
            {
              "item": {
                "id": "minecraft:daylight_detector"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "You have a glow about you",
          "longDescription": "It\u0027s not just quartz there in the nether, hanging above you is this wonderful glowing stone that has more then a few potential uses. More then that it will help light up a room like no other. ",
          "items": [
            {
              "item": {
                "id": "minecraft:glowstone_dust"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "minecraft:glowstone",
          "amount": 16
        }
      ]
    },
    {
      "name": "Sandy Souls",
      "description": "So there is more then just netherrack and quartz. There\u0027s also this strange brownish looking substance that is.... staring at you. You might want to find out what that\u0027s all about right? ",
      "x": 73,
      "y": 46,
      "icon": {
        "id": "minecraft:soul_sand"
      },
      "prerequisites": [
        "Crystal Clear"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Soul Food",
          "longDescription": "Soul sand is unique in that it\u0027s the substance you\u0027ll eventually want to grow netherwart on (We\u0027ll talk about that shortly), You can turn it into glass, and you can even use it to just slow someone down. It should be all about the nether in large patches. You might also try putting this in a sieve. ",
          "items": [
            {
              "item": {
                "id": "minecraft:soul_sand"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Throw a brick",
          "longDescription": "Much like cobblestone, netherrack too can be cooked, but when it gets cooked it turns into this lovely netherbrick, which can be fantastic for decroation and also a hint more blast resistant then it\u0027s uncooked cousin. ",
          "items": [
            {
              "item": {
                "id": "minecraft:nether_brick"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "minecraft:netherbrick",
          "amount": 16
        }
      ]
    },
    {
      "name": "Butterfly in the sky",
      "description": "That ghast can go twice as high. Take a look it wants to cook, all of you! It can go anywhere, places to explode and ways to run! But seriously this giant flying ghost wants to kill you",
      "x": 35,
      "y": 49,
      "icon": {
        "id": "minecraft:ghast_tear"
      },
      "prerequisites": [
        "Sandy Souls"
      ],
      "trigger": "ANTI_TRIGGER",
      "tasks": [
        {
          "type": "DETECT",
          "description": "Tears of the Prohpets ",
          "longDescription": "The Ghast tear is a wonderful item with powerful properties that is dropped by those mean spirited flying evil creatures and it\u0027s definately worth a hint of investigation. From witchery to alchemy it has many different uses, but you have to kill a ghast first",
          "items": [
            {
              "item": {
                "id": "minecraft:ghast_tear"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Blaze a path",
          "longDescription": "You might have noticed that Ghast weren\u0027t the only horrible creatures which inhabit the nether. OUt there as well is the Blaze, and if you kill it, you might just get a Blaze rod. They\u0027re great as a source of fuel, but more then that they can help you get started on the path to alchemy ",
          "items": [
            {
              "item": {
                "id": "minecraft:blaze_rod"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "minecraft:potion",
          "damage": 8193
        }
      ]
    },
    {
      "name": "X-Potion ",
      "description": "One of the worst things about a good Role Playing game is that you have to save all your potions. Well not this time, we\u0027re going to make sure you have 800 Skill points in Brewing by the time we\u0027ve gotten done teaching you ",
      "x": 58,
      "y": 89,
      "icon": {
        "id": "minecraft:brewing_stand"
      },
      "prerequisites": [
        "Butterfly in the sky"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "A good base",
          "longDescription": "The start of any potion lies in the netherwart. Initially these can only be found in the seemingly unbreachable nether fortresses scattered across the nether. Placing it on soulsand will allow it to grow ",
          "items": [
            {
              "item": {
                "id": "minecraft:nether_wart"
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Making a Stand",
          "longDescription": "You remember that blaze rod? Well combinging it with some cobble will get you the next component needed to get this whole process started, the brewing stand. ",
          "items": [
            {
              "item": {
                "id": "minecraft:brewing_stand"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "A swift process",
          "longDescription": "Now it\u0027s time to mix and match. Netherwart will always go first in these basic potions, then you can add other ingredients, like perhaps a ghast tear, or even sugar for going a bit faster. Expiriment with all the combintations and even the additives (like redstone and glowstone)",
          "items": [
            {
              "item": {
                "id": "minecraft:potion",
                "damage": 8194
              }
            }
          ]
        }
      ],
      "rewardchoice": [
        {
          "id": "minecraft:potion",
          "damage": 8227
        },
        {
          "id": "minecraft:potion",
          "damage": 8261
        }
      ]
    },
    {
      "name": "The Worst kind of Skeleton",
      "description": "There are few things more depressing then a crature made of such a mess. The Wither Skeleton which only spends it\u0027s time in the hearts of Nether Fortresses is one such crature. Kill one and take it\u0027s head and you will be on a path to very powerful things. ",
      "x": 19,
      "y": 83,
      "icon": {
        "id": "minecraft:skull",
        "damage": 1
      },
      "prerequisites": [
        "Butterfly in the sky"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Getting ahead",
          "longDescription": "The wither skeleton skull has a low chance of dropping, but place 3 upon a T shape of soul sand and you can summon into the world a powerful entity known as the wither. Killing it will reward and incredibly powerful prize. ",
          "items": [
            {
              "item": {
                "id": "minecraft:skull",
                "damage": 1
              },
              "required": 3
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "minecraft:obsidian",
          "amount": 3
        },
        {
          "id": "minecraft:glass",
          "amount": 5
        },
        {
          "id": "minecraft:soul_sand",
          "amount": 4
        }
      ]
    },
    {
      "name": "Farming the Fires",
      "description": "So you have gotten used to farming in the real world, but what about farming elsewhere? Are you ready for such a thing? Well it\u0027s time to learn how to farm through the fire and the flames",
      "x": 132,
      "y": 17,
      "icon": {
        "id": "ganysnether:spectreWheatItem"
      },
      "prerequisites": [
        "Sandy Souls"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "We need a better ho",
          "longDescription": "In the nether a simple Iron or stone ho simply won\u0027t do. No, now you\u0027re going to need to upgrade to the Diamond and Gold varients in order to till netherrack. ",
          "items": [
            {
              "item": {
                "id": "minecraft:diamond_hoe"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Reed-Solomon Correction",
          "longDescription": "It turs out if you flip a few bits of a plants genetic code, it starts to learn to grow by lava and emit light! Who would have thunk it? These grow just like reeds in the overworld but they require lava! They can be ground up into glowstone rather then sugar",
          "items": [
            {
              "item": {
                "id": "ganysnether:glowingReedItem"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "A ghost of a chance",
          "longDescription": "What kind of fun would we be having if we didn\u0027t have some wonderful ghostly seeds to really get our day started? Like wheat but requiring tilled netherrack and a lava source to help hydrate, these plants are quite the thing to see",
          "items": [
            {
              "item": {
                "id": "ganysnether:ghostSeeds"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ganysnether:dimensionalBread"
        }
      ]
    },
    {
      "name": "A Firey passion",
      "description": "It\u0027s not just Glowing Reeds or Ghostly seeds that you should be on the lookout for. The nether also offers up a unique kind of cactus as well, and this one will just set your hearts ablaze! ",
      "x": 127,
      "y": 68,
      "icon": {
        "id": "ganysnether:blazingCactoid"
      },
      "prerequisites": [
        "Farming the Fires"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Factoid? Cactoid? ",
          "longDescription": "The blazing Cactoid like it\u0027s overworld cousin the cactus is a little painful to touch, but it can give you great rewards. Planting it on non tilled netherrack will let it grow for harvesting. ",
          "items": [
            {
              "item": {
                "id": "ganysnether:blazingCactoid"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Nuggets a Blaze",
          "longDescription": "If you take this already burning little plant, you can throw it in the furnace and before you even know it the fuel will be there for you to find yourself with Blaze Nuggets. ",
          "items": [
            {
              "item": {
                "id": "ganysnether:blazeIngot",
                "damage": 2
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Ingots on Fire ",
          "longDescription": "Crafting those blaze nuggets in a 3x3 square (9 in total) will reward you with the Blaze ingot, which might give you a nice set of armor that lies between Iron and Diamond, It\u0027s definately worth some investigation! ",
          "items": [
            {
              "item": {
                "id": "ganysnether:blazeIngot",
                "damage": 1
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ganysnether:blazeBoots"
        }
      ]
    },
    {
      "name": "Berry Rewarding",
      "description": "You didn\u0027t think in your overworld centric view that sunlight and water were the only places that had berries did you? Well now it\u0027s time to meet a whole new variety of berry bush. ",
      "x": 186,
      "y": 16,
      "icon": {
        "id": "ganysnether:quarzBerry"
      },
      "prerequisites": [
        "Farming the Fires"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Quarz don\u0027t you mean...",
          "longDescription": "Much like the other nether crops, this must be grown on tilled netherrack next to lava in order to grow, but the little berries it drops can eventually be crafted in to quartz and who doens\u0027t like that? ",
          "items": [
            {
              "item": {
                "id": "ganysnether:quarzBerry"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "It\u0027s not a dingleberry",
          "longDescription": "Like its cousin the Quarz berry bush this again will require tilled netherrack and a lava source block to hydrate, but the berry\u0027s can be combined with an empty bucket to make a lava bucket which everyone can use. ",
          "items": [
            {
              "item": {
                "id": "ganysnether:lavaBerry"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "minecraft:ghast_tear"
        }
      ]
    },
    {
      "name": "Bonemeal 2.0",
      "description": "Alright so this stuff doesn\u0027t come in a fancy bottle and it\u0027s not exactly made from Algae extracts, but the Living soul is a great way to get your nether based plants to grow a little faster",
      "x": 247,
      "y": 20,
      "icon": {
        "id": "ganysnether:livingSoul"
      },
      "prerequisites": [
        "Berry Rewarding"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Bones, Flesh, and Souls",
          "longDescription": "No seriously, you need bones, some rotten flesh, and some soul sand and you will be rewarded with this lovely smiling face (who can say no to that?) It can be applied to your nether crops to make them grow just a bit faster",
          "items": [
            {
              "item": {
                "id": "ganysnether:livingSoul"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ganysnether:ghostSeeds",
          "amount": 5
        }
      ]
    },
    {
      "name": "All you can drink",
      "description": "Sometimes you just feel like you want to remove an ocean, but where could you possibly put all of that water? Well now there\u0027s an answer to that question. ",
      "x": 298,
      "y": 13,
      "icon": {
        "id": "ganysnether:bottomlessBucket"
      },
      "prerequisites": [
        "Bonemeal 2.0"
      ],
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Mr. Bucket",
          "longDescription": "This bucket acts like any other except that when you put a liquid into it, you aren\u0027t getting it back. You can put as much of a liquid in there as you like but it\u0027s never filling up. Great for getting rid of small lakes and streams",
          "items": [
            {
              "item": {
                "id": "ganysnether:bottomlessBucket"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "HardcoreQuesting:bags",
          "damage": 1
        }
      ]
    },
    {
      "name": "PK Fire! ",
      "description": "You know those days when you\u0027re playing super smash brothers and you get the home run bat? Well this is nothing like those days except that you have a bat with quite a swing. ",
      "x": 285,
      "y": 63,
      "icon": {
        "id": "ganysnether:baseballBat"
      },
      "prerequisites": [
        "Bonemeal 2.0"
      ],
      "trigger": "ANTI_TRIGGER",
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Fox, Final Destination",
          "longDescription": "The bat doens\u0027t do that much damage but it can knock back your enemies a bit. Simply craft it with 2 netherbricks, a diamond, and 2 Knockback I books and you\u0027ll have your very own SSB tool of choice",
          "items": [
            {
              "item": {
                "id": "ganysnether:baseballBat"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "HardcoreQuesting:bags",
          "damage": 2
        }
      ]
    },
    {
      "name": "What\u0027s in the Box? ",
      "description": "So as you\u0027re exploring the nether you might just have noticed a few spare boxes sitting around doing nothing. Have you ever wondered by chance what those actually are? Well now it\u0027s time to learn!",
      "x": 183,
      "y": 60,
      "icon": {
        "id": "ganysnether:soulChest"
      },
      "prerequisites": [
        "A Firey passion"
      ],
      "trigger": "ANTI_TRIGGER",
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Step 1 - Cut a hole in... ",
          "longDescription": "As if a Hopper and a chest had a child. This is a chest that you can throw things on top of and it will keep inside (So like a hungry chest). The recipie is simple enough, just put soulsand in a U Shape in the crafting bench with a single nether quartz at the top",
          "items": [
            {
              "item": {
                "id": "ganysnether:soulChest"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Step 2 - put your stuff... ",
          "longDescription": "This second variety of container you can get by cooking the first. You might even find these scattered throughout the nether with gifts inside already from the fallen adventurers of the past. The nice thing about this box is if you die it can store your things inside ",
          "items": [
            {
              "item": {
                "id": "ganysnether:undertaker"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "HardcoreQuesting:bags",
          "damage": 2
        }
      ]
    },
    {
      "name": "Lava Lava Everywhere",
      "description": "The truth is, that sometimes there are just items that you don\u0027t want in your inventory anymore, and honestly who can blame you for that. But wouldn\u0027t you love to turn it into something useful? ",
      "x": 115,
      "y": 130,
      "icon": {
        "id": "ganysnether:denseLavaCell"
      },
      "prerequisites": [
        "A Firey passion"
      ],
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Hot Brick! ",
          "longDescription": "Crafted with diamonds and lava buckets, these little densely packed fuel cells don\u0027t exaclty come cheap, but who can argue with that quality. The fuel cells are a recipie worth knowing as they could come in handy for more then a few future projects. ",
          "items": [
            {
              "item": {
                "id": "ganysnether:denseLavaCell"
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Vulcan\u0027s Pot!",
          "longDescription": "The Volcanic furnance is a unique device that turns items into lava, which you can then get out through various methods including pipes, or buckets, or the like. Simply put items in and this furance will slowly cook them into lava ",
          "items": [
            {
              "item": {
                "id": "ganysnether:volcanicFurnace"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "minecraft:netherrack",
          "amount": 64
        }
      ]
    },
    {
      "name": "Advanced Lava",
      "description": "Sometimes you want to melt things, but you need them to melt just a bit faster, woudln\u0027t you agree? Well we are here to help you on your quest to make your volcanic furnace the mount Vesuvius of furnaces",
      "x": 74,
      "y": 117,
      "icon": {
        "id": "ganysnether:focusedLavaCell"
      },
      "prerequisites": [
        "Lava Lava Everywhere"
      ],
      "trigger": "ANTI_TRIGGER",
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Step One: Get chiseled",
          "longDescription": "So this may seem like a tough task but it\u0027s actually not /so/ bad. You just take an exisiting quarts block, then put it on a crafting bench. DO this 8 times and then place it around a squid\u0027s ink sack! ",
          "items": [
            {
              "item": {
                "id": "ganysnether:colouredChiselledQuartzBlock"
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Step Two: Find the source",
          "longDescription": "Next you are going to need a nether core. Note that these nether cores are the very essance of what the nether is all about so it may take some exploring to truely get all the ingredients!",
          "items": [
            {
              "item": {
                "id": "ganysnether:netherCore"
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Step Three: ??? ",
          "longDescription": "Finally when you have gathered your resources it\u0027s time to construct these little devices which will make your volcanic furnaces convert things into lava all that much faster! ",
          "items": [
            {
              "item": {
                "id": "ganysnether:focusedLavaCell"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ganysnether:focusedLavaCell",
          "amount": 3
        }
      ]
    },
    {
      "name": "Spawning the Truth",
      "description": "You may have started to notice throughout this world you are exploring, these deceptively interesting little cages from which monsters and creatures just appear? Well it\u0027s time to learn how to control them!",
      "x": 58,
      "y": 142,
      "icon": {
        "id": "ganysnether:spawnerUpgrade"
      },
      "prerequisites": [
        "Advanced Lava"
      ],
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Creating the Danger Room",
          "longDescription": "So you\u0027re not exacly charles Xavier and this isn\u0027t exactly the X-Men, but it is a good start to making your very own danger room. Surrounding a nether core in Coal and Coal blocks will get you started on your journey. Simply right click and a spawner will turn into an extended spawner. ",
          "items": [
            {
              "item": {
                "id": "ganysnether:spawnerUpgrade"
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Moving to Westfall",
          "longDescription": "It\u0027s time to level your spawner up and the quickest way to do that is through the next upgrade. Much like the level 0, this is made with a nethercore, but this time surrounded by Iron. It will allow you to attach attributes to your spawner! ",
          "items": [
            {
              "item": {
                "id": "ganysnether:spawnerUpgrade",
                "damage": 1
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "A silky smooth finish",
          "longDescription": "To apply any upgrade all you need to do is right click the spawner with it. To see those upgrades SHift + right Click. NOTE: It may require a block update before the spawner realizes it\u0027s been changed, it\u0027s a bit finicky. ",
          "items": [
            {
              "item": {
                "id": "ganysnether:spawnerUpgrade",
                "damage": 11
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ganysnether:spawnerUpgrade",
          "damage": 8
        }
      ]
    },
    {
      "name": "Centrifrugal ",
      "description": "Have you ever wanted to take two items and smash them together just to see what you can get? Well then it\u0027s time to learn about the Magma Centrifuge. It\u0027s an amazing piece of technology!",
      "x": 102,
      "y": 179,
      "icon": {
        "id": "ganysnether:magmaticCentrifuge"
      },
      "prerequisites": [
        "Advanced Lava"
      ],
      "trigger": "ANTI_TRIGGER",
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Just add Lava",
          "longDescription": "You\u0027ll have to expiriment to find the exact combinations, but needless to say you add two blocks and a bit of lava and you\u0027ll get something entirely new out of it. We suggest trying netherrack and Glowstone! ",
          "items": [
            {
              "item": {
                "id": "ganysnether:magmaticCentrifuge"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "minecraft:redstone",
          "amount": 64
        }
      ]
    },
    {
      "name": "Power of the Star",
      "description": "In most games a star is the key to being invisible, the literal power of the heavens, well after defeating a Wither you too will now have access to the stars",
      "x": 18,
      "y": 148,
      "icon": {
        "id": "ganysnether:sceptreOfConcealment"
      },
      "prerequisites": [
        "The Worst kind of Skeleton"
      ],
      "trigger": "ANTI_TRIGGER",
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Crowning Achievement",
          "longDescription": "Now that you have your netherstar it\u0027s time to mix it with a few ingredients. Surround the netherstar with eggs to get started on your concealment cap. Yes that\u0027s right normal chicken eggs",
          "items": [
            {
              "item": {
                "id": "ganysnether:sceptreCap",
                "damage": 2
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "You\u0027ve got egg on you",
          "longDescription": "Alright now for the fun, if you can construct this wand you\u0027ll find it has the ability to turn whatever monster you choose to use it against into it\u0027s egg form. On it\u0027s own that doesn\u0027t seem incredibly useful, but there are certainly possibilities ",
          "items": [
            {
              "item": {
                "id": "ganysnether:sceptreOfConcealment"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "minecraft:spawn_egg",
          "damage": 92
        }
      ]
    },
    {
      "name": "To Recreate Life",
      "description": "You venture into the territory of gods mortal, be weary where you step because once you have thrown yourself to this power there may be no coming back from it. It\u0027s time to meet that which would change the world. ",
      "x": 60,
      "y": 186,
      "icon": {
        "id": "ganysnether:reproducer"
      },
      "prerequisites": [
        "Power of the Star"
      ],
      "tasks": [
        {
          "type": "CRAFT",
          "description": "I\u0027m your reanimator! ",
          "longDescription": "The Reproducer will allow you to convert an egg from one to another, but you must know the secret formula. The Left most slot is for the egg you wish to replicate. The RIght most for the egg you are going to use. The middle two the ingredients that will convert the right egg into what the left is. THis may require some expirimentation. ",
          "items": [
            {
              "item": {
                "id": "ganysnether:reproducer"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "HardcoreQuesting:bags",
          "damage": 3
        }
      ]
    },
    {
      "name": "Scepter Power",
      "description": "The power to turn monsters into eggs isn\u0027t the only power held by those nether stars. It\u0027s time to do a bit more expirimentation and find out just what else a nether star can do! ",
      "x": 18,
      "y": 184,
      "icon": {
        "id": "ganysnether:sceptreOfLightning"
      },
      "prerequisites": [
        "Power of the Star"
      ],
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Luminaire! ",
          "longDescription": "Outside of being Crono\u0027s most powerful attacks, lightning is an elemental power that you can harvest for yourself. By surrounding a netherstar with netherwart and quartz you should be able to deliver the power of a time traveling hero!",
          "items": [
            {
              "item": {
                "id": "ganysnether:sceptreCap",
                "damage": 1
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Ramuh",
          "longDescription": "An esper of olden day a primal of new. This staff with give you the power to command the very heavens before your will, but be careful it\u0027s power is limited. If you\u0027ve ever wanted to make your own charged creeper though. ",
          "items": [
            {
              "item": {
                "id": "ganysnether:sceptreOfLightning"
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Ifirit",
          "longDescription": "You should know the drill by now. TNT, a Fire Charge, and Blaze ingots will get you the core. This scepter summons up the power of fire to be rained down upon your enemies. ",
          "items": [
            {
              "item": {
                "id": "ganysnether:sceptreOfFireCharging"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "minecraft:spawn_egg",
          "damage": 57
        }
      ]
    },
    {
      "name": "Glass the land",
      "description": "So yo might have noticed that unlike the normal world which you are from, the properties of this one even allow you to cook soulglass into some glass, or even it\u0027s close cousin heat sand, which you might find scattered in the nether ",
      "x": 92,
      "y": 77,
      "icon": {
        "id": "ganysnether:soulGlass"
      },
      "prerequisites": [
        "Sandy Souls"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "items": [
            {
              "item": {
                "id": "ganysnether:soulGlass"
              }
            },
            {
              "item": {
                "id": "Natura:NetherGlass",
                "damage": 1
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "items": [
            {
              "item": {
                "id": "ganysnether:soulGlass",
                "damage": 1
              }
            },
            {
              "item": {
                "id": "ganysnether:soulGlassStairs"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ganysnether:soulGlass",
          "amount": 16
        }
      ]
    },
    {
      "name": "More Berry Fun",
      "description": "If you thought you were done collecting berries it\u0027s time to think again. The nether is an endless expanse of all kinds of wonderful things to choose and eat. Some good, some bad",
      "x": 224,
      "y": 83,
      "icon": {
        "id": "Natura:berry.nether",
        "damage": 2
      },
      "prerequisites": [
        "Berry Rewarding"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Eat the Sky",
          "longDescription": "These berries are found in colorful blue and purple bushes scattered throughout the nether. The bushes themselves can be planted on netherrack just about anywhere, but the real power is in their ability to heal and give a short jump boost ",
          "items": [
            {
              "item": {
                "id": "Natura:berry.nether",
                "damage": 2
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Not found in Duskwood",
          "longDescription": "Found in red and black bushes throughout the nether that can be planted on netherrack, soul sand or even tained soil. These duskberries will restore some hunger, make you a bit blind and also give you night vision. Taste on to figure out how that all works out. ",
          "items": [
            {
              "item": {
                "id": "Natura:berry.nether",
                "damage": 1
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "For Sylvanas",
          "longDescription": "The purple and pink bush with little green berries that is the blightberry can be found in the nether and planted on netherrack or tainted soil. The blightberries they grow can give you 8 seconds of regeneration but 4 seconds of poison, so eat wisely ",
          "items": [
            {
              "item": {
                "id": "Natura:berry.nether"
              }
            }
          ]
        }
      ],
      "rewardchoice": [
        {
          "id": "Natura:berry.nether",
          "amount": 5
        },
        {
          "id": "Natura:berry.nether",
          "damage": 1,
          "amount": 5
        },
        {
          "id": "Natura:berry.nether",
          "damage": 2,
          "amount": 5
        }
      ]
    },
    {
      "name": "Netherscape!",
      "description": "Now that you\u0027re nice and embedded in the nether wouldn\u0027t now be a good time to learn about all the things around you? That\u0027s a trick question and the answer is yes, yes it would!",
      "x": 183,
      "y": 117,
      "icon": {
        "id": "Natura:soil.tainted"
      },
      "prerequisites": [
        "More Berry Fun"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "The taint!",
          "longDescription": "Buried deep in the heart of the nether is a special type of soil that only finds uses for certain plants and trees, it is known as tainted soil, and unlike regular dirt or sand, this tainted soil has all the nutrients a growing evil tree needs. ",
          "items": [
            {
              "item": {
                "id": "Natura:soil.tainted"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Something Smells",
          "longDescription": "What do you associate with demons? Why the winchesters and sulfer of course. You may have noticed that around the nether there are these strange clouds! Well you can break them down and use the remnants to help make explosives!",
          "items": [
            {
              "item": {
                "id": "Natura:barleyFood",
                "damage": 4
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Ashes to Ashes ",
          "longDescription": "Another type of cloud you might find floating around in the nether is the Ash Cloud. This wonderful little cloud can be compacted down into coal if you want yet another supply of the staple fuel. ",
          "items": [
            {
              "item": {
                "id": "Natura:Cloud",
                "damage": 2
              },
              "required": 9
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "Natura:Natura.netherfood"
        }
      ]
    },
    {
      "name": "Shroomaroo",
      "description": "Alright so you\u0027re probalby wondering what these strange glowing fungi are hanging about the nether? Well it\u0027s time to get a crash course in Mycology! ",
      "x": 278,
      "y": 105,
      "icon": {
        "id": "Natura:Glowshroom",
        "damage": 2
      },
      "prerequisites": [
        "More Berry Fun"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "All manner of Glowing!",
          "longDescription": "Glowing shrooms naturally find themselves in the nether. it is where they are the happiest and thus where they are most likely to grow. Finding a mushroom is easy, it\u0027s the harvesting it that can be tough, what with all the other horrible things in the nether. ",
          "items": [
            {
              "item": {
                "id": "Natura:Glowshroom"
              }
            },
            {
              "item": {
                "id": "Natura:Glowshroom",
                "damage": 1
              }
            },
            {
              "item": {
                "id": "Natura:Glowshroom",
                "damage": 2
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Edible!",
          "longDescription": "What good are mushrooms if you can\u0027t eat them? Now you can regrow them with a bit of bonemeal just like a normal mushroom but they do not spread, but shoving them into a bowl will make a lovely dinner",
          "items": [
            {
              "item": {
                "id": "Natura:natura.stewbowl",
                "damage": 14
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "HardcoreQuesting:bags",
          "damage": 1
        }
      ]
    },
    {
      "name": "Special Leather",
      "description": "We\u0027ve all heard about the finely crafted leathers of the world, but what about the kind of leather you get from a little imp of a creature? This stuff is great for making sure you don\u0027t burn!",
      "x": 185,
      "y": 178,
      "icon": {
        "id": "Natura:barleyFood",
        "damage": 6
      },
      "prerequisites": [
        "Netherscape!"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Nether Leather!",
          "longDescription": "Imps often keep to themsleves in the nether, but lucky for us you can still murder them and take their skin. The great thing is because they are using to living there when you make armor out of their flesh, it\u0027s fire resistant! ",
          "items": [
            {
              "item": {
                "id": "Natura:barleyFood",
                "damage": 6
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "Natura:natura.armor.impjerkin",
          "nbt": "{ench:[0:{lvl:1s,id:3s},1:{lvl:1s,id:1s}]}"
        }
      ]
    },
    {
      "name": "Furance - V2 ",
      "description": "Alright so you\u0027ve made yourself a regular furnace, but how about a netherbrick furance? It\u0027s time to learn the great secrets of this hot rock and how best to apply it!",
      "x": 140,
      "y": 179,
      "icon": {
        "id": "Natura:NetherFurnace"
      },
      "prerequisites": [
        "Lava Lava Everywhere"
      ],
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Oven Baked Oven",
          "longDescription": "Crafted just like a regular furance except this time with netherbrick, it\u0027s a little bit faster and can help you out when perhaps cobblestone is at a premium. ",
          "items": [
            {
              "item": {
                "id": "Natura:NetherFurnace"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "minecraft:coal",
          "damage": 1,
          "amount": 4
        }
      ]
    },
    {
      "name": "A bow born of fire",
      "description": "So imagine if Sailor mars had a bow and arrow? This is probably the kind of thing that it would be made from if we were going to have to guess on such things!",
      "x": 268,
      "y": 182,
      "icon": {
        "id": "Natura:barleyFood",
        "damage": 7
      },
      "prerequisites": [
        "Special Leather",
        "Netherwoods"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Strung together ",
          "longDescription": "In the nether there are these rather lovely looking spiders called Heatscar Spiders, which just so happen to spawn in the nehter. Kill them and they might be tempted to drop the special kind of silk that they work with ",
          "items": [
            {
              "item": {
                "id": "Natura:barleyFood",
                "damage": 7
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Bloody Bows!",
          "longDescription": "The bloodwood bow is much like a normal blow. Crafted from Flamestring and Blood Wood sticks it is much more durable then it\u0027s overworld counterpart, can be enchanted, and just looks nice to boot ",
          "items": [
            {
              "item": {
                "id": "Natura:natura.bow.bloodwood"
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Fletching!",
          "longDescription": "If you don\u0027t have a chicken handy to help you with the process of making your very own arrows, then you should invest in a smaller chicken alternative. Ghostwood can be used to craft fletching which can be used in place of feathers for making arrows. ",
          "items": [
            {
              "item": {
                "id": "Natura:barleyFood",
                "damage": 5
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "minecraft:arrow",
          "amount": 64
        }
      ]
    },
    {
      "name": "Netherwoods",
      "description": "So you\u0027ve gone to the nether, and sure it\u0027s nice, but wouldn\u0027t you like to come back with a nice prize for your work? Perhaps something to show your devotion to exploring this strange and new land!",
      "x": 225,
      "y": 143,
      "icon": {
        "id": "Natura:bloodwood"
      },
      "prerequisites": [
        "Netherscape!"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "The second floor",
          "longDescription": "Scattered throughout the nether are specific kinds of trees. As you can imagine these have to be a bit more heat resistant then most, but what\u0027s most important is that they\u0027ve collected all the blood",
          "items": [
            {
              "item": {
                "id": "Natura:planks",
                "damage": 4
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Tree Shaper!",
          "longDescription": "Now that you\u0027ve got yourself some blood wood off of one of those lovely upside trees, it might be a good time to learn about the fancy items you can craft from it\u0027s wood like this fancy thing can shear a tree just like a pair of shears",
          "items": [
            {
              "item": {
                "id": "Natura:natura.kama.bloodwood"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "Natura:natura.axe.bloodwood"
        }
      ]
    },
    {
      "name": "This litttle light of mine",
      "description": "The key to keeping the monsters at bay is keeping the world well lit. Torches are good, but Glowstone covers a greater area in terms of keeping things lit. So it\u0027s time to learn about all the ways to make use of that glowstone. ",
      "x": 86,
      "y": 12,
      "icon": {
        "id": "minecraft:redstone_lamp"
      },
      "prerequisites": [
        "Sandy Souls"
      ],
      "trigger": "ANTI_TRIGGER",
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Shine on!",
          "longDescription": "By combining the glowstone dust in a 2x2 pattern you will be able to craft your very first glowstone block. These blocks provide a light level of 15 but when broken if you don\u0027t have silk touch they will be converted back into dust ",
          "items": [
            {
              "item": {
                "id": "minecraft:glowstone"
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Screwing in a lightbulb",
          "longDescription": "By wrapping your glowstone in a bit of redstone, you should be able activate and deactivate it\u0027s output of light based upon the signal recieved!",
          "items": [
            {
              "item": {
                "id": "minecraft:redstone_lamp"
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "The Glow Box",
          "longDescription": "Sometimes you want those glowstone properties, but you don\u0027t want to have to worry about using redstone to power them. It\u0027s time to meet the tasteful and decorative Glow box, which can be made by surrounding a piece of glowstone dust with glass panes!",
          "items": [
            {
              "item": {
                "id": "ganysnether:glowBox",
                "damage": 11
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "minecraft:glowstone",
          "amount": 16
        }
      ]
    }
  ],
  "reputationBar": []
}